Revit 2027 API
UpdaterRegistry.UnregisterUpdater(UpdaterId) Method
 Removes the updater associated with the input id from the UpdaterRegistry. Also removes all triggers associated with the Updater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void UnregisterUpdater(
	UpdaterId id
)
Public Shared Sub UnregisterUpdater (
	id As UpdaterId
)
public:
static void UnregisterUpdater(
	UpdaterId^ id
)
static member UnregisterUpdater :
        id : UpdaterId -> unit
Parameters
id UpdaterId
 Id of updater to be removed
Exceptions
Exception | Condition
ArgumentException |  Updater with this Id is not currently registered in Revit.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The updater's owner's AddIn does not match the currently active AddIn, i.e. IUpdater.GetUpdaterId().GetAddInId() differs from the addInId field in the manifest file of the currently executing external application. -or- Attempting to unregister an updater that is currently being executed.
Remarks
 This methods works regardless of how the updater was registered. Whether the updater was registered application-wide or for a document (or a set of document), it will be removed from the registry and any connections with documents will also be lost.
See Also
Reference
UpdaterRegistry Class
UnregisterUpdater Overload
Autodesk.Revit.DB Namespace